#вводи параметры
weight = float(input("Введите ваш вес (кг): "))
height = float(input("Введите ваш рост (м): "))

#рассчитываем по формуле
bmi = weight / (height ** 2)

#выводим результат
print(f"Ваш индекс массы тела (ИМТ): {bmi:.1f}")
if bmi < 16:
    print("Выраженный дефицит массы тела, требуется медицинское вмешательство!")
if 16 <= bmi <= 18.4:
    print("Недостаточная масса тела")
if 18.5 <= bmi <= 24.9:
    print("Нормальная масса тела")
if 25 <= bmi <= 29.9:
    print("Избыточная масса тела(предожирение)")
if 30 <= bmi <= 34.9:
    print("Ожирение 1 степени")
if 35 <= bmi <= 39.9:
    print("Ожирение 2 степени")
if bmi >= 40:
    print("Ожирение 3 степени")
